OdDAI.AggregationType.type(std.shared_ptr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new type code for the aggregation data type.
\param typeCode [in] A type code for the aggregation data type to be set.

OdDAI.AggregationType.#ctor(OdSmartPtr&lt;OdDAI.BaseType&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new aggregation type definition with a specified data type of its element.
\param elementType [in] A smart pointer to a data type contained in the aggregation type.

OdDAI.AggregationType.Dispose
\details
Destroys the aggregation type definition object.

OdDAI.AggregationType.#ctor
\details
Creates a new aggregation type definition with default parameters.

OdDAI.AggregationType
\details
A class that implements the storing and manipulating of aggregation types.